{"keras_version": "2.0.8", "config": [{"config": {"trainable": true, "dtype": "float32", "merge_mode": "concat", "batch_input_shape": [null, 384, 1], "name": "bidirectional_1", "layer": {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "use_bias": true, "return_state": false, "name": "lstm_1", "recurrent_dropout": 0.0, "dropout": 0.0, "trainable": true, "return_sequences": true, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "unroll": false, "implementation": 0, "stateful": false, "bias_constraint": null, "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null}, "class_name": "LSTM"}}, "class_name": "Bidirectional"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "bidirectional_2", "trainable": true, "merge_mode": "concat", "layer": {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "use_bias": true, "return_state": false, "name": "lstm_2", "recurrent_dropout": 0.0, "dropout": 0.0, "trainable": true, "return_sequences": true, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "unroll": false, "implementation": 0, "stateful": false, "bias_constraint": null, "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null}, "class_name": "LSTM"}}, "class_name": "Bidirectional"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_size": [50], "activation": "relu", "padding": "valid", "kernel_regularizer": null, "strides": [1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 100, "name": "conv1d_1", "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_1", "trainable": true, "pool_size": [5], "padding": "valid", "strides": [5]}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 5, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}