{"keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dtype": "float32", "filters": 200, "bias_regularizer": null, "strides": [1], "trainable": true, "padding": "same", "use_bias": true, "batch_input_shape": [null, 300, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [5], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_1", "bias_constraint": null, "dilation_rate": [1]}}, {"class_name": "MaxPooling1D", "config": {"strides": [5], "trainable": true, "padding": "valid", "name": "max_pooling1d_1", "pool_size": [5]}}, {"class_name": "Conv1D", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 200, "bias_regularizer": null, "strides": [1], "trainable": true, "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [5], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_2", "bias_constraint": null, "dilation_rate": [1]}}, {"class_name": "MaxPooling1D", "config": {"strides": [5], "trainable": true, "padding": "valid", "name": "max_pooling1d_2", "pool_size": [5]}}, {"class_name": "Conv1D", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 200, "bias_regularizer": null, "strides": [1], "trainable": true, "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [5], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_3", "bias_constraint": null, "dilation_rate": [1]}}, {"class_name": "MaxPooling1D", "config": {"strides": [5], "trainable": true, "padding": "valid", "name": "max_pooling1d_3", "pool_size": [5]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "units": 5, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1"}}]}