{"config": [{"config": {"bias_regularizer": null, "kernel_size": [5], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "batch_input_shape": [null, 300, 1], "activation": "relu", "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "name": "conv1d_1", "kernel_constraint": null, "activity_regularizer": null, "filters": 200, "trainable": true}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_1", "pool_size": [5], "trainable": true, "strides": [5], "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"bias_regularizer": null, "kernel_size": [5], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "name": "conv1d_2", "trainable": true, "activity_regularizer": null, "filters": 200, "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_2", "pool_size": [5], "trainable": true, "strides": [5], "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"bias_regularizer": null, "kernel_size": [5], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "name": "conv1d_3", "trainable": true, "activity_regularizer": null, "filters": 200, "kernel_constraint": null}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_3", "pool_size": [5], "trainable": true, "strides": [5], "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "units": 5, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow"}