{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8", "config": [{"class_name": "Conv1D", "config": {"name": "conv1d_1", "batch_input_shape": [null, 300, 1], "dtype": "float32", "trainable": true, "filters": 200, "kernel_constraint": null, "padding": "same", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1], "activity_regularizer": null, "kernel_size": [5], "strides": [1], "use_bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "strides": [5], "trainable": true, "pool_size": [5], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "filters": 200, "kernel_constraint": null, "padding": "valid", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1], "activity_regularizer": null, "kernel_size": [5], "strides": [1], "use_bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "strides": [5], "trainable": true, "pool_size": [5], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "filters": 200, "kernel_constraint": null, "padding": "valid", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1], "activity_regularizer": null, "kernel_size": [5], "strides": [1], "use_bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "strides": [5], "trainable": true, "pool_size": [5], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "units": 5, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true}}]}