{"class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"kernel_size": [5], "filters": 200, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv1d_1", "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "strides": [1], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "padding": "same", "batch_input_shape": [null, 300, 1], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [5], "strides": [5], "trainable": true, "name": "max_pooling1d_1", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"kernel_size": [5], "filters": 200, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv1d_2", "trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "padding": "valid", "strides": [1], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [5], "strides": [5], "trainable": true, "name": "max_pooling1d_2", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"kernel_size": [5], "filters": 200, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv1d_3", "trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "padding": "valid", "strides": [1], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [5], "strides": [5], "trainable": true, "name": "max_pooling1d_3", "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "units": 5, "kernel_constraint": null, "activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}}]}