{"keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "name": "conv1d_1", "trainable": true, "dtype": "float32", "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5], "use_bias": true, "kernel_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "batch_input_shape": [null, 300, 1], "activity_regularizer": null, "filters": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "padding": "valid", "strides": [5], "pool_size": [5]}}, {"class_name": "Conv1D", "config": {"strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "name": "conv1d_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "kernel_size": [5], "use_bias": true, "kernel_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "padding": "valid", "filters": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "padding": "valid", "strides": [5], "pool_size": [5]}}, {"class_name": "Conv1D", "config": {"strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "name": "conv1d_3", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "kernel_size": [5], "use_bias": true, "kernel_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "padding": "valid", "filters": 200}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "trainable": true, "padding": "valid", "strides": [5], "pool_size": [5]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "trainable": true, "activity_regularizer": null, "activation": "softmax", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}]}