{"keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"bias_regularizer": null, "padding": "same", "batch_input_shape": [null, 300, 1], "kernel_constraint": null, "kernel_size": [5], "trainable": true, "name": "conv1d_1", "bias_constraint": null, "use_bias": true, "activation": "relu", "strides": [1], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1], "filters": 200, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "padding": "valid", "pool_size": [5], "strides": [5], "trainable": true}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [5], "name": "conv1d_2", "dilation_rate": [1], "use_bias": true, "activation": "relu", "strides": [1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 200, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "padding": "valid", "pool_size": [5], "strides": [5], "trainable": true}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [5], "name": "conv1d_3", "dilation_rate": [1], "use_bias": true, "activation": "relu", "strides": [1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 200, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "padding": "valid", "pool_size": [5], "strides": [5], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "units": 5, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null}}], "class_name": "Sequential"}